[
  {
    "date": "2021-09-06",
    "project": "Portfolio Index",
    "name": "Super Simple Protfolio Index",
    "description": "Just a super simple Blazor Client Side that reads a static json file to keep a listing of the protfolio stuff I am actively or most recently put together... basically going to be the new index of 406jem.",
    "appurl": null,
    "githuburl": "https://github.com/Justin-Mann/406jem"
  },
  {
    "date": "2021-09-06",
    "project": "2021 Digitial Resume Demos",
    "name": "Resume Blazor Client Demo",
    "description": "I put together a blazor client that uses AAD to autheticate and make use of a Core 5 Service API backed by cosmos db.  I have other service APIs published and ready to take advantage of, but for the Blazor Demo I just did the bare minumum to prove public and scoped access to the Resume Service API using AAD.  I have plans to build out a more complete Angular client application and use B2C to support customer account creation and control.  The point of this was just to prove out a use case for single org aad using Blazor; like an internal business application for someone already using AAD...",
    "appurl": "https://resumeblazorclient20210906120150.azurewebsites.net/",
    "githuburl": "https://github.com/Justin-Mann/ResumeBlazorClient"
  },
  {
    "date": "2021-09-06",
    "project": "2021 Digitial Resume Demos",
    "name": "Resume Service APIs",
    "description": "Some lightweight service that could be containerized and deployed just about anywhere.. no cross communication or anything, but these are basically app domain microservices, or the beginings of them.  They are currently protected with aad but if you want to interact with the published apis you can do so using the postman environment and profile avaliable in the repo.",
    "appurl": null,
    "githuburl": "https://github.com/Justin-Mann/ResumeServices"
  },
  {
    "date": "2021-09-06",
    "project": "Recent Ask for a Job Application Process",
    "name": "ADO.Net Recipe Manager App",
    "description": "Was asked to build an MVC app using ADO.Net (no entity framework) using Core 5. so I did... I didn't want to over commit time to this (I did anyways) and this is what I came up with.  The interesting bit here (that I focused on anyways) is keeping the data layer as fast as possible and using a repository layer (I absolutely overdid the repos in hindsight, but in a good way I suppose). Anyways here it is in all it's mocked and unfinished glory, keep in mind this was just a demo of some very specific things so a lot was left unfinished.'",
    "appurl": "https://recipemanager20210827143215.azurewebsites.net/",
    "githuburl": "https://github.com/Justin-Mann/RecipeManager"
  }
]